{
  "NotFoundPage": {
    "title": "Page not found",
    "description": "Sorry, we couldn't find the page you're looking for. It might have been removed, renamed, or is temporarily unavailable.",
    "button": "Back to homepage"
  },
  "NavBar": {
    "aboutMe": "About Me",
    "specialties": "Specialties",
    "projects": "Projects",
    "journey": "Journey",
    "contact": "Contact"
  },
  "footer": {
    "rights": "All rights reserved",
    "developedBy": "Developed by"
  },
  "quotes": [
    {
      "message": "Start where you are. Use what you have. Do what you can.",
      "author": "Arthur Ashe"
    },
    {
      "message": "Our greatest glory is not in never falling, but in rising every time we fall.",
      "author": "Confucius"
    },
    {
      "message": "Don't find fault, find a remedy.",
      "author": "Henry Ford"
    },
    {
      "message": "Simplicity is the ultimate sophistication.",
      "author": "Leonardo da Vinci"
    },
    {
      "message": "Failure is simply the opportunity to begin again, this time more intelligently.",
      "author": "Henry Ford"
    },
    {
      "message": "It does not matter how slowly you go as long as you do not stop.",
      "author": "Confucius"
    },
    {
      "message": "If you can't explain it simply, you don't understand it well enough.",
      "author": "Albert Einstein"
    },
    {
      "message": "There is no failure, only results and lessons.",
      "author": "Tony Robbins"
    }
  ],
  "HomePage": {
    "technologies": {
      "typescript": {
        "short": "JavaScript superset that adds static typing.",
        "full": "TypeScript is a language based on JavaScript that adds optional static typing. This improves code readability, simplifies maintenance, and reduces development-time errors, making it widely used in medium to large-scale applications."
      },
      "dart": {
        "short": "Modern language by Google, mainly used with Flutter.",
        "full": "Dart is a programming language optimized for building modern, reactive interfaces. Developed by Google, it is strongly typed, object-oriented, and widely used with Flutter for building cross-platform applications."
      },
      "golang": {
        "short": "Efficient, compiled language ideal for scalable backends.",
        "full": "Go, also known as Golang, is a compiled language created by Google focused on simplicity, performance, and concurrency. It is widely used in APIs, servers, and distributed systems due to its lightness and robustness."
      },
      "tailwindcss": {
        "short": "Utility-first CSS framework for modern responsive UIs.",
        "full": "TailwindCSS is a utility-first framework that provides predefined classes for styling directly in HTML. It speeds up development, keeps visual consistency, and reduces custom CSS."
      },
      "nextjs": {
        "short": "React framework with hybrid rendering, great for SEO and performance.",
        "full": "Next.js is a React framework supporting server-side rendering (SSR), static site generation (SSG), and built-in APIs. It's ideal for modern applications focused on performance, SEO, and great developer experience."
      },
      "shadcnui": {
        "short": "Accessible components styled with Radix and TailwindCSS.",
        "full": "shadcn/ui is a component library built with Radix UI and styled using TailwindCSS. It combines accessibility, customization, and best practices for building modern React interfaces with strong usability."
      },
      "flutter": {
        "short": "Google's framework for cross-platform apps with one codebase.",
        "full": "Flutter is a UI toolkit by Google for building native apps for Android, iOS, Web, and Desktop from a single codebase using Dart. It offers a rich widget collection, high performance, and modern UI capabilities."
      },
      "fastify": {
        "short": "Lightweight and fast Node.js web framework focused on performance.",
        "full": "Fastify is a web framework for Node.js designed for high performance with low overhead. It's extensible via plugins and great for building fast, scalable APIs."
      },
      "nestjs": {
        "short": "Backend framework for Node.js with modular TypeScript architecture.",
        "full": "NestJS is a modern backend framework built with TypeScript and inspired by Angular. It promotes modular architecture, eases testing, and supports both Express and Fastify under the hood."
      },
      "sqlite": {
        "short": "Lightweight, embedded relational database ideal for local apps.",
        "full": "SQLite is a lightweight, embedded, self-contained, serverless SQL database engine. It's widely used in mobile apps, desktop tools, and embedded systems for its simplicity and efficiency."
      },
      "postgresql": {
        "short": "Robust, open-source, and highly scalable relational database.",
        "full": "PostgreSQL is an open-source relational database known for its robustness, standards compliance, and extensibility. It supports JSON, replication, advanced indexing, and more."
      },
      "prisma": {
        "short": "Modern ORM for Node.js and TypeScript focused on performance and DX.",
        "full": "Prisma is a next-gen ORM that makes database access easy with a type-safe API for TypeScript. It improves developer productivity, ensures data consistency, and supports databases like PostgreSQL, MySQL, and SQLite."
      },
      "firebase": {
        "short": "Google platform offering services like auth, real-time DB, and more.",
        "full": "Firebase is a platform by Google offering services like authentication, real-time database, Firestore, analytics, push notifications, storage, and hosting to speed up app development."
      },
      "nodejs": {
        "short": "JavaScript runtime for backend development, based on V8.",
        "full": "Node.js is a JavaScript runtime built on Chrome's V8 engine for running code server-side. It's widely used for building APIs, servers, and real-time applications with high performance."
      }
    },
    "HeroSection": {
      "greeting": "Hi! I'm Dário Matias",
      "description": "I'm a Full Stack developer with a strong focus on web and mobile frontend, and experience in backend development. I'm currently studying Systems Analysis and Development at IFPB - Campus Esperança and continuously strive to improve my skills through various projects.",
      "contactButton": "Contact me",
      "downloadCV": "Download CV",
      "scrollLabel": "Scroll to next section"
    },
    "AboutSection": {
      "title": "About Me",
      "paragraphs": [
        "I'm a Full Stack developer with experience building complete solutions — from modern, accessible interfaces to robust backend integrations.",
        "On the frontend, I use React and Next.js to develop responsive, high-performance applications with great user experience. I also work with Flutter to build native and cross-platform mobile apps.",
        "On the backend, I work with TypeScript (Node.js) and Go, creating scalable, secure, and high-performance APIs with a focus on best practices, testing, and maintainability.",
        "I'm committed to technical quality and continuously improving, aiming to deliver well-structured, efficient, and sustainable solutions — whether in personal or professional projects."
      ]
    },
    "SpecialtiesSection": {
      "title": "A Complete Approach",
      "description": "From conception to delivery, my work covers the entire lifecycle of a digital product.",
      "techTitle": "My Tech Stack",
      "techDescription": "Tools and technologies I use to build modern, high-performance, and high-quality digital solutions.",
      "visitOfficialSite": "Visit official website",
      "services": {
        "site": {
          "title": "Website Development",
          "description": "Responsive, modern, and SEO-optimized websites."
        },
        "app": {
          "title": "App Development",
          "description": "Cross-platform apps with great user experience."
        },
        "server": {
          "title": "Server Development",
          "description": "Secure, robust, and scalable backend APIs and systems."
        }
      }
    },
    "ProjectsSection": {
      "createdTitle": "What I Have Created",
      "createdDescription": "A selection of my main projects developed throughout my journey.",
      "projects": {
        "portfolio": {
          "description": "Personal portfolio with information about me, projects, experiences, and contact."
        },
        "flutterGuideApp": {
          "description": "Flutter Guide is an educational app that helps developers learn Flutter through practical examples."
        },
        "flutterGuideWeb": {
          "description": "Official Flutter Guide website with information, main features, screenshots, privacy policy, and a direct link to download on the Google Play Store."
        },
        "scrollInfinity": {
          "description": "Flutter package for simplified infinite scrolling."
        },
        "flutterSyntaxHighlighter": {
          "description": "A widget for syntax highlighting of Dart and Flutter code, with support for light and dark themes, line numbers, and code selection."
        },
        "goValidators": {
          "description": "Package with validation utilities to ensure data integrity in Go (GoLang) applications, using only native libraries."
        }
      },
      "linkDetails": {
        "github": {
          "label": "View Repository",
          "tooltip": "Repository on GitHub, where you can access the full source code of the project, follow updates, issues, and contribute."
        },
        "site": {
          "label": "View Site",
          "tooltip": "Official project website."
        },
        "playStore": {
          "label": "View on Play Store",
          "tooltip": "Application page on Google Play Store, the official app store for Android devices, where you can download and rate the app."
        },
        "pubDev": {
          "label": "View on pub.dev",
          "tooltip": "Dart/Flutter package hosted on pub.dev, the official repository for Dart/Flutter packages, where you can see documentation, versions, and dependencies."
        },
        "goDev": {
          "label": "View on pkg.go.dev",
          "tooltip": "Go (GoLang) package hosted on pkg.go.dev, the official repository of Go libraries, with documentation and technical details."
        }
      }
    },
    "JourneySection": {
      "title": "Journey",
      "description": "My professional and academic journey, where each step was an opportunity for growth and learning.",
      "career": "Career",
      "experiences": {
        "media4all": {
          "role": "Mobile Developer",
          "description": "Development and maintenance of mobile applications built with Flutter and integration with REST APIs.",
          "location": "João Pessoa, Paraíba, Brazil · Remote",
          "type": "Internship"
        }
      },
      "education": "Education",
      "educations": {
        "ads": {
          "degree": "Technologist in Systems Analysis and Development",
          "period": "Feb 2024 - Dec 2027",
          "status": "In progress"
        }
      }
    },
    "ContactSection": {
      "title": "Get in Touch",
      "description": "I'm available to discuss potential collaborations, project ideas, or any professional matters.",
      "form": {
        "subject": {
          "placeholder": "Subject",
          "error": "Subject is required."
        },
        "email": {
          "placeholder": "Your email",
          "errorRequired": "Email is required.",
          "errorInvalid": "Please enter a valid email address."
        },
        "message": {
          "placeholder": "Your message...",
          "error": "Message is required."
        },
        "submit": "Send",
        "sending": "Sending..."
      },
      "toast": {
        "success": "Email successfully sent",
        "error": "Error while sending email"
      },
      "socialLinks": {
        "title": "Social Networks",
        "description": "Follow me to stay updated on my projects and updates, or send a message."
      },
      "email": {
        "copied": "Email copied!",
        "ariaLabel": "Copy email"
      }
    }
  }
}
