{
  "NotFoundPage": {
    "title": "Página não encontrada",
    "description": "Desculpe, não conseguimos encontrar a página que você está procurando. Ela pode ter sido removida, renomeada ou estar temporariamente indisponível.",
    "button": "Voltar à página inicial"
  },
  "NavBar": {
    "aboutMe": "Sobre Mim",
    "specialties": "Especialidades",
    "projects": "Projetos",
    "journey": "Trajetória",
    "contact": "Contato"
  },
  "footer": {
    "rights": "Todos os direitos reservados",
    "developedBy": "Desenvolvido por"
  },
  "quotes": [
    "Comece de onde você está. Use o que você tem. Faça o que você pode.",
    "A maior glória não é ficar de pé, mas levantar-se cada vez que se cai."
  ],
  "HomePage": {
    "HeroSection": {
      "greeting": "Olá! Eu sou Dário Matias",
      "description": "Sou um desenvolvedor Full Stack, com destaque em frontend web e mobile, e experiência em backend. Atualmente, curso Análise e Desenvolvimento de Sistemas no IFPB - Campus Esperança e, de forma contínua, busco evoluir meus conhecimentos por meio de projetos variados.",
      "contactButton": "Fale comigo",
      "downloadCV": "Baixar Currículo",
      "scrollLabel": "Scroll para a próxima seção"
    },
    "AboutSection": {
      "title": "Sobre Mim",
      "paragraphs": [
        "Sou um desenvolvedor Full Stack com experiência na criação de soluções completas — de interfaces modernas e acessíveis a integrações com sistemas robustos de backend.",
        "No frontend, utilizo React e Next.js para desenvolver aplicações responsivas, performáticas e com excelente experiência do usuário. Também atuo com Flutter no desenvolvimento mobile, criando apps nativos e multiplataforma.",
        "No backend, trabalho com TypeScript (Node.js) e Go, construindo APIs escaláveis, seguras e de alta performance, com foco em boas práticas, testes e manutenção.",
        "Tenho compromisso com a qualidade técnica e estou em constante evolução, buscando entregar soluções bem estruturadas, eficientes e sustentáveis — seja em projetos pessoais ou profissionais."
      ]
    },
    "SpecialtiesSection": {
      "title": "Uma Abordagem Completa",
      "description": "Da concepção à entrega, meu trabalho abrange todo o ciclo de vida de um produto digital.",
      "techTitle": "Minha Stack Tecnológica",
      "techDescription": "Ferramentas e tecnologias que utilizo para construir soluções digitais modernas, performáticas e de alta qualidade.",
      "visitOfficialSite": "Visitar site oficial",
      "services": {
        "site": {
          "title": "Criação de Sites",
          "description": "Desenvolvimento de websites responsivos, modernos e otimizados para SEO."
        },
        "app": {
          "title": "Criação de Aplicativos",
          "description": "Desenvolvimento de apps multiplataforma com ótima experiência do usuário."
        },
        "server": {
          "title": "Criação de Servidores",
          "description": "APIs e sistemas backend seguros, robustos e escaláveis com boas práticas."
        }
      },
      "technologies": {
        "typescript": {
          "short": "Superset do JavaScript que adiciona tipagem estática ao JS.",
          "full": "TypeScript é uma linguagem baseada em JavaScript que adiciona tipagem estática opcional. Essa tipagem melhora a legibilidade do código, facilita a manutenção e reduz erros durante o desenvolvimento, sendo amplamente adotada em aplicações de médio e grande porte."
        },
        "dart": {
          "short": "Linguagem moderna desenvolvida pelo Google, usada principalmente com Flutter.",
          "full": "Dart é uma linguagem de programação otimizada para desenvolvimento de interfaces modernas e reativas. Desenvolvida pelo Google, é fortemente tipada, suporta orientação a objetos e é amplamente utilizada com o Flutter para criar aplicações multiplataforma."
        },
        "golang": {
          "short": "Linguagem de programação eficiente e compilada, ideal para backends escaláveis.",
          "full": "Go, também conhecida como Golang, é uma linguagem de programação compilada e criada pelo Google, focada em simplicidade, performance e concorrência. É amplamente utilizada no desenvolvimento de APIs, servidores e sistemas distribuídos devido à sua leveza e robustez."
        },
        "tailwindcss": {
          "short": "Framework utilitário de CSS para construir interfaces modernas e responsivas.",
          "full": "TailwindCSS é um framework utilitário que oferece classes pré-definidas para estilização direta no HTML. Ele proporciona agilidade no desenvolvimento de interfaces responsivas, mantendo consistência visual e reduzindo a necessidade de CSS personalizado."
        },
        "nextjs": {
          "short": "Framework React com renderização híbrida, ótimo para SEO e performance.",
          "full": "Next.js é um framework para aplicações React que permite renderização do lado do servidor (SSR), geração de sites estáticos (SSG) e APIs integradas. Ideal para aplicações modernas, com foco em performance, SEO e ótima experiência de desenvolvedor."
        },
        "shadcnui": {
          "short": "Componentes acessíveis e estilizados usando Radix e TailwindCSS.",
          "full": "shadcn/ui é uma coleção de componentes acessíveis, construídos com Radix UI e estilizados com TailwindCSS. Ele combina acessibilidade, personalização e boas práticas, sendo ideal para interfaces modernas em aplicações React com foco em usabilidade e consistência."
        },
        "flutter": {
          "short": "Framework da Google para criar apps multiplataforma com uma única base de código.",
          "full": "Flutter é um framework de UI criado pela Google que permite desenvolver aplicações nativas para Android, iOS, Web e Desktop com uma única base de código, utilizando a linguagem Dart. Ele oferece uma rica coleção de widgets, alta performance e suporte a interfaces modernas."
        },
        "fastify": {
          "short": "Framework web Node.js leve e rápido, com foco em performance.",
          "full": "Fastify é um framework web para Node.js projetado para oferecer alta performance com baixa sobrecarga. É extensível por plugins e é excelente para APIs rápidas e escaláveis."
        },
        "nestjs": {
          "short": "Framework backend para Node.js com arquitetura modular baseada em TypeScript.",
          "full": "NestJS é um framework backend moderno construído com TypeScript e inspirado no Angular. Ele promove uma arquitetura modular, facilita testes e permite o uso de bibliotecas express ou fastify."
        },
        "sqlite": {
          "short": "Banco de dados relacional leve e embutido, ideal para apps locais.",
          "full": "SQLite é um banco de dados SQL leve, embutido, autocontido e sem servidor. Ele é amplamente utilizado em aplicações mobile, desktop e sistemas embarcados por sua simplicidade e eficiência."
        },
        "postgresql": {
          "short": "Banco de dados relacional robusto, open source e altamente escalável.",
          "full": "PostgreSQL é um banco de dados relacional open source conhecido por sua robustez, conformidade com padrões e extensibilidade. Ele oferece suporte a JSON, replicação, indexação avançada e mais."
        },
        "prisma": {
          "short": "ORM moderno para Node.js e TypeScript com foco em performance e DX.",
          "full": "Prisma é um ORM de próxima geração que facilita o acesso a bancos de dados com uma API tipada em TypeScript. Ele melhora a produtividade do desenvolvedor, garante consistência nos dados e é compatível com bancos como PostgreSQL, MySQL e SQLite."
        },
        "firebase": {
          "short": "Plataforma do Google com serviços para apps como auth, banco em tempo real e mais.",
          "full": "Firebase é uma plataforma do Google que oferece diversos serviços como autenticação, banco de dados em tempo real, Firestore, analytics, notificações push, storage e hosting para acelerar o desenvolvimento de aplicações."
        },
        "nodejs": {
          "short": "Ambiente de execução para JavaScript no backend, baseado em V8.",
          "full": "Node.js é um ambiente de execução de JavaScript no lado do servidor, baseado no motor V8 do Chrome. Ele é amplamente usado para construir APIs, servidores e aplicações em tempo real com alta performance."
        }
      },
      "createdTitle": "O Que Tenho Criado",
      "createdDescription": "Uma seleção dos meus principais projetos desenvolvidos ao longo da minha trajetória.",
      "projects": {
        "portfolio": {
          "title": "Portfólio",
          "description": "Portfólio pessoal com informações sobre mim, projetos, experiências e contato."
        },
        "flutterGuideApp": {
          "title": "Flutter Guide App",
          "description": "Flutter Guide é um app educativo que ajuda desenvolvedores a aprender Flutter por meio de exemplos práticos."
        },
        "flutterGuideWeb": {
          "title": "Flutter Guide Web",
          "description": "Site oficial do Flutter Guide, com informações, principais funcionalidades, capturas de tela, política de privacidade e link direto para download na Google Play Store."
        },
        "scrollInfinity": {
          "title": "Scroll Infinity",
          "description": "Pacote Flutter para adição simplificada de rolagem infinita."
        },
        "goValidators": {
          "title": "Go Validators",
          "description": "Pacote com utilitários de validação para garantir a integridade dos dados em aplicações Go (GoLang), utilizando apenas bibliotecas nativas."
        }
      }
    },
    "JourneySection": {
      "title": "Trajetória",
      "description": "Minha jornada profissional e acadêmica, onde cada passo foi uma oportunidade de crescimento e aprendizado.",
      "career": "Carreira",
      "experiences": {
        "media4all": {
          "role": "Desenvolvedor Mobile",
          "description": "Desenvolvimento e manutenção de aplicativos móveis construídos em Flutter e integração com APIs REST.",
          "location": "João Pessoa, Paraíba, Brasil · Remota",
          "type": "Estágio"
        }
      },
      "education": "Educação",
      "educations": {
        "ads": {
          "degree": "Tecnólogo em Análise e Desenvolvimento de Sistemas",
          "period": "fev de 2024 - dez de 2027",
          "status": "Em andamento"
        }
      }
    },
    "ContactSection": {
      "title": "Entre em Contato",
      "description": "Estou à disposição para discutir possíveis colaborações, ideias de projeto ou quaisquer assuntos profissionais.",
      "form": {
        "subject": {
          "placeholder": "Assunto",
          "error": "O assunto é obrigatório."
        },
        "email": {
          "placeholder": "Seu e-mail",
          "errorRequired": "O e-mail é obrigatório.",
          "errorInvalid": "Por favor, insira um e-mail válido."
        },
        "message": {
          "placeholder": "Sua mensagem...",
          "error": "A mensagem é obrigatória."
        },
        "submit": "Enviar",
        "sending": "Enviando..."
      },
      "toast": {
        "success": "Email enviado com sucesso",
        "error": "Erro ao enviar email"
      },
      "socialLinks": {
        "title": "Redes Sociais",
        "description": "Me acompanhe para ficar por dentro dos meus projetos e atualizações, ou envie uma mensagem."
      }
    }
  }
}